# -*- coding: cp1251 -*-
s = "Кожухарь Володимир Олександрович"
length = len(s)
print(f"2.1\n{s}")
print(f"Третій символ рядка: {s[2]}")
print(f"Передостанній символ рядка: {s[-2]}")
print(f"Перші п'ять символів рядка: {s[:5]}")
print(f"Рядок без двох останніх символів: {s[:-2]}")
print(f"Символи з парними індексами: {s[:-1:2]}")
print(f"Символи з непарними індексами: {s[1:-1:2]}")
print(f"Рядок у зворотньому порядку: {s[::-1]}")
print(f"Символи через один у зворотньому порядку: {s[::-2]}")
print(f"Довжина рядка: {length}")
print (f"2.2    Розрізаний рядок на дві частини: ", end = "")
print(s[(length//2):] + s[:(length//2)])
print(f"2.3    Рядок з видаленним елементом: {s[:length//2] + s[(length//2 + 1):]}")
print(f"2.4    Рядок з видаленними елементами індексих яких діляться на 3: ", end = "")
i = 0
while(i < length):
    if i % 3 != 0 or i == 0:
        print(s[i], end = "")
        i += 1
    else:
        i+=1
print(f"\n2.5   {s[0] + s[-2:0:-1] + s[-1]}")